# films = {
#    'Магия': {
#        'Гарри Поттер и Философский Камень': 2008,
#        'Фантастические твари и где они обитают': 2013,
#        'Хроники Нарнии': 2014
# },
#    'Фантастика': {
#        'Матрица': 2009,
#        'Господин Никто': 2012,
#        'Я - начало': 2016
#    },
#    'Космос': {
#        'Интерстеллар': 2015,
#        'Марсианин': 2014,
#        'Пассажиры': 2013
#    },
#    'Marvel': {
#        'Мстители: Война бесконечности': 2018,
#        'Дэдпул': 2020,
#        'Стражи галактики': 2016
#    }
# }
# # for key in films:
# #     films["Магия"]["Ученик Чародея"] = 2010
# # print(films)
# for category in films:
#     for film, year in films[category].items():
#         if year >= 2016:
#             print(f"{film}-{year}")
